src/test/resources/br.gov.caixa.arqrefservices.soap/INCLUSAO_BOLETO_ENTRADA.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:bol="http://caixa.gov.br/sibar/manutencao_cobranca_bancaria/boleto"
	xmlns:sib="http://caixa.gov.br/sibar">
	<soapenv:Header />
	<soapenv:Body>
		<bol:SERVICO_ENTRADA>
			<sib:HEADER>
				<VERSAO>1.0</VERSAO>
				<AUTENTICACAO>uZZ0lO87BCnVUm3KEGc/a6EMZssQ2Y72ACA0PudwLTk=
				</AUTENTICACAO>
				<USUARIO_SERVICO>SCNLFECD</USUARIO_SERVICO>
				<OPERACAO>INCLUI_BOLETO</OPERACAO>
				<SISTEMA_ORIGEM>SIGCB</SISTEMA_ORIGEM>
				<UNIDADE>0002</UNIDADE>
				<IDENTIFICADOR_ORIGEM>127.0.0.1</IDENTIFICADOR_ORIGEM>
				<DATA_HORA>20160109152436</DATA_HORA>
			</sib:HEADER>
			<DADOS>
				<INCLUI_BOLETO>
					<CODIGO_BENEFICIARIO>0820001</CODIGO_BENEFICIARIO>
					<TITULO>
						<NOSSO_NUMERO>14800500000113701</NOSSO_NUMERO>
						<NUMERO_DOCUMENTO>1100000619</NUMERO_DOCUMENTO>
						<DATA_VENCIMENTO>2017-01-21</DATA_VENCIMENTO>
						<VALOR>234.56</VALOR>
						<TIPO_ESPECIE>99</TIPO_ESPECIE>
						<FLAG_ACEITE>N</FLAG_ACEITE>
						<DATA_EMISSAO>2017-01-09</DATA_EMISSAO>
						<JUROS_MORA>
							<TIPO>ISENTO</TIPO>
							<VALOR>0.0</VALOR>
						</JUROS_MORA>
						<POS_VENCIMENTO>
							<ACAO>DEVOLVER</ACAO>
							<NUMERO_DIAS>0</NUMERO_DIAS>
						</POS_VENCIMENTO>
						<CODIGO_MOEDA>09</CODIGO_MOEDA>
						<PAGADOR>
							<CPF>01702374947</CPF>
							<NOME>teste</NOME>
							<ENDERECO>
								<LOGRADOURO>SEPN Quadra 512 Conjunto C Lote 9</LOGRADOURO>
								<BAIRRO>Asa Sul</BAIRRO>
								<CIDADE>Brasília</CIDADE>
								<UF>DF</UF>
								<CEP>70760500</CEP>
							</ENDERECO>
						</PAGADOR>
						<IDENTIFICACAO_EMPRESA>040005110000061989001</IDENTIFICACAO_EMPRESA>
						<FICHA_COMPENSACAO>
							<MENSAGENS>
								<MENSAGEM>Pagamento até o vencimento</MENSAGEM>
							</MENSAGENS>
						</FICHA_COMPENSACAO>
						<RECIBO_PAGADOR>
							<MENSAGENS>
								<MENSAGEM>Pagável sommente na CAIXA</MENSAGEM>
							</MENSAGENS>
						</RECIBO_PAGADOR>
						<PAGAMENTO>
							<QUANTIDADE_PERMITIDA>1</QUANTIDADE_PERMITIDA>
							<TIPO>NAO_ACEITA_VALOR_DIVERGENTE</TIPO>
							<PERCENTUAL_MINIMO>0.0</PERCENTUAL_MINIMO>
							<PERCENTUAL_MAXIMO>0.0</PERCENTUAL_MAXIMO>
						</PAGAMENTO>
					</TITULO>
					<FLAG_REGISTRO>S</FLAG_REGISTRO>
				</INCLUI_BOLETO>
			</DADOS>
		</bol:SERVICO_ENTRADA>
	</soapenv:Body>
</soapenv:Envelope>